# RoofComponents Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents Class
Members See Also
---
A class that contains multiple roof slab infos of a roof.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class RoofComponents : IDisposable
```

Visual Basic
---
```text
Public Class RoofComponents _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RoofComponents : IDisposable
```

# Remarks
This class contains a series of collections that are all of the same length, and whose nth index corresponds to the nth slab of the roof.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..RoofComponents
# See Also
RoofComponents Members
Autodesk.Revit.DB.IFC Namespace